In [1]:
import pandas as pd
import re
from datetime import date

In [2]:
df= pd.read_csv("Data\initial_Data(01-31-23).csv")

In [3]:
df.head()

,Price,Bedrooms,Bathrooms,Area,Location,id
0,"EGP 3,800,000",3,2,165 SQM,"Maamoura, Alexandria•",193349318
1,"EGP 7,000,000",5,5,442 SQM,"Smoha, Alexandria•",195609810
2,"EGP 3,250,000",3,2,188 SQM,"Kafr Abdo, Alexandria•",195082183
3,"EGP 1,500,000",2,1,126 SQM,"Roushdy, Alexandria•",195155604
4,"EGP 2,300,000",4,1,160 SQM,"Sidi Beshr, Alexandria•",194914485

In [4]:
df.describe()

          Bedrooms            id
count  5919.000000  5.919000e+03
mean      2.743876  1.943653e+08
std       0.746029  2.620180e+06
min       1.000000  1.452196e+08
25%       2.000000  1.943638e+08
50%       3.000000  1.948444e+08
75%       3.000000  1.953232e+08
max      10.000000  1.956434e+08

In [11]:
df["id"].nunique()

5873

In [13]:
ids = df["id"]
df[ids.isin(ids[ids.duplicated()])].sort_values("id")

,Price,Bedrooms,Bathrooms,Area,Location,id
656,"EGP 3,500,000",3,2,200 SQM,"Roushdy, Alexandria•",185984446
7,"EGP 3,500,000",3,2,200 SQM,"Roushdy, Alexandria•",185984446
0,"EGP 3,800,000",3,2,165 SQM,"Maamoura, Alexandria•",193349318
711,"EGP 3,800,000",3,2,165 SQM,"Maamoura, Alexandria•",193349318
333,"EGP 6,000,000",3,3,248 SQM,"Smoha, Alexandria•",193648833
...,...,...,...,...,...,...
22,"EGP 4,650,000",3,3,240 SQM,"Kafr Abdo, Alexandria•",195614128
36,"EGP 8,700,000",3,3,350 SQM,"Smoha, Alexandria•",195630348
179,"EGP 8,700,000",3,3,350 SQM,"Smoha, Alexandria•",195630348
35,"EGP 490,000Negotiable",2,1,110 SQM,"Abu Talat, Alexandria•",195643234
49,"EGP 490,000Negotiable",2,1,110 SQM,"Abu Talat, Alexandria•",195643234

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5919 entries, 0 to 5918
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      5919 non-null   object
 1   Bedrooms   5919 non-null   int64
 2   Bathrooms  5919 non-null   object
 3   Area       5919 non-null   object
 4   Location   5919 non-null   object
 5   id         5919 non-null   int64
dtypes: int64(2), object(4)
memory usage: 277.6+ KB

## Lets First Clean Remove strings from price, area, and bathrooms

In [12]:
df['Price'] = df["Price"].str.replace(r"[\D]",'',regex=True)
df['Price'] = df['Price'].astype(int)

df['Area'] = df["Area"].str.replace(r"[\D]",'',regex=True)
df['Area'] = df['Area'].astype(int)


df['Bathrooms'] = df["Bathrooms"].str.replace(r"[\D]",'',regex=True)
df['Bathrooms'] = df['Bathrooms'].astype(int)

In [13]:
df.head()

     Price  Bedrooms  Bathrooms  Area                 Location         id
0  3800000         3          2   165    Maamoura, Alexandria•  193349318
1  7000000         5          5   442       Smoha, Alexandria•  195609810
2  3250000         3          2   188   Kafr Abdo, Alexandria•  195082183
3  1500000         2          1   126     Roushdy, Alexandria•  195155604
4  2300000         4          1   160  Sidi Beshr, Alexandria•  194914485

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5919 entries, 0 to 5918
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      5919 non-null   int32
 1   Bedrooms   5919 non-null   int64
 2   Bathrooms  5919 non-null   int32
 3   Area       5919 non-null   int32
 4   Location   5919 non-null   object
 5   id         5919 non-null   int64
dtypes: int32(3), int64(2), object(1)
memory usage: 208.2+ KB

## Remove "Alexandria" and only keep the location

In [15]:
df["Location"] = df["Location"].str.split(',').str[0]

In [16]:
df.head()

     Price  Bedrooms  Bathrooms  Area    Location         id
0  3800000         3          2   165    Maamoura  193349318
1  7000000         5          5   442       Smoha  195609810
2  3250000         3          2   188   Kafr Abdo  195082183
3  1500000         2          1   126     Roushdy  195155604
4  2300000         4          1   160  Sidi Beshr  194914485

In [17]:
df["Location"].unique()

array(['Maamoura', 'Smoha', 'Kafr Abdo', 'Roushdy', 'Sidi Beshr',
       'Sporting', 'Agami', 'Laurent', 'Saba Pasha', 'Glim', 'Asafra',
       'Zezenia', 'Moharam Bik', 'Miami', 'Gianaclis', 'Abu Talat',
       'Sidi Gaber', 'Stanley', 'Bacchus', 'Victoria', 'Nakheel',
       'Mandara', 'Abu Qir', 'San Stefano', 'Bolkly', 'Schutz',
       'Cleopatra', 'Montazah', 'Al Ibrahimiyyah', 'Raml Station',
       'Dekheila', 'Bahray - Anfoshy', 'Seyouf', 'Amreya', 'Camp Caesar',
       'Azarita', 'Fleming', 'Gomrok', 'Labban', 'Borg al-Arab',
       'Dhahria', 'Awayed', '•', 'Attarin', 'Manshiyya', 'Al Hadrah',
       'Wardian', 'El Max', 'Salehia', 'Ras El Tin', 'Shatby',
       'Koum al-Dikka', 'Kabbary'], dtype=object)

# Lets replace "Laurent" with "Louran"

In [18]:
df["Location"] = df["Location"].str.replace('Laurent', "Louran")

In [19]:
df["Location"].unique()

array(['Maamoura', 'Smoha', 'Kafr Abdo', 'Roushdy', 'Sidi Beshr',
       'Sporting', 'Agami', 'Louran', 'Saba Pasha', 'Glim', 'Asafra',
       'Zezenia', 'Moharam Bik', 'Miami', 'Gianaclis', 'Abu Talat',
       'Sidi Gaber', 'Stanley', 'Bacchus', 'Victoria', 'Nakheel',
       'Mandara', 'Abu Qir', 'San Stefano', 'Bolkly', 'Schutz',
       'Cleopatra', 'Montazah', 'Al Ibrahimiyyah', 'Raml Station',
       'Dekheila', 'Bahray - Anfoshy', 'Seyouf', 'Amreya', 'Camp Caesar',
       'Azarita', 'Fleming', 'Gomrok', 'Labban', 'Borg al-Arab',
       'Dhahria', 'Awayed', '•', 'Attarin', 'Manshiyya', 'Al Hadrah',
       'Wardian', 'El Max', 'Salehia', 'Ras El Tin', 'Shatby',
       'Koum al-Dikka', 'Kabbary'], dtype=object)

In [20]:
df.head()

     Price  Bedrooms  Bathrooms  Area    Location         id
0  3800000         3          2   165    Maamoura  193349318
1  7000000         5          5   442       Smoha  195609810
2  3250000         3          2   188   Kafr Abdo  195082183
3  1500000         2          1   126     Roushdy  195155604
4  2300000         4          1   160  Sidi Beshr  194914485

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5919 entries, 0 to 5918
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      5919 non-null   int32
 1   Bedrooms   5919 non-null   int64
 2   Bathrooms  5919 non-null   int32
 3   Area       5919 non-null   int32
 4   Location   5919 non-null   object
 5   id         5919 non-null   int64
dtypes: int32(3), int64(2), object(1)
memory usage: 208.2+ KB

# Finally, It's All Clean Lets now save it

In [24]:
today = date.today()
current_date = today.strftime("%m-%d-%y")
csv_name="clean_data({})".format(current_date)
print(csv_name)

clean_data(01-31-23)

In [25]:
df.to_csv("Data/"+csv_name+".csv",index=False)